jlpoltrack/mLRS/mLRS/modules/stm32-dronecan-lib/stm32-dronecan-driver-c5.c
//*******************************************************
// STM32 DroneCAN Library
// Copyright (c) OlliW, OlliW42, www.olliw.eu
// GPL3
// https://www.gnu.org/licenses/gpl-3.0.de.html
//*******************************************************
// DroneCAN Driver Library for STM32 using HAL
// for use with libcanard
//*******************************************************
// This is the STM32C5 version. The C5's FDCAN peripheral is the same Bosch M_CAN
// as the G4's and H5's, so the register level parts of this file are a copy of
// stm32-dronecan-driver-h5.c. Keep the three in sync, but mind these differences:
// - the C5 ships ST's HAL2 driver package, where the whole FDCAN API was renamed
//   and restructured: a handle carries an instance *enum* rather than a pointer,
//   config went from HAL_FDCAN_Init(&h) with an Init struct to HAL_FDCAN_Init() +
//   HAL_FDCAN_SetConfig(), and the Tx header is a bitfield union instead of a
//   struct of pre-shifted register values. So this driver keeps its own
//   fdcan_regs pointer for all direct register work, and uses HAL2 only for
//   config, filters, start and transmit.
// - the C552 has FDCAN1 only, the FDCAN2 sections are inactive
// The FDCAN bus and kernel clocks are set up by can_init() in stdstm32-can.h, as on
// the other families.
//*******************************************************
#if defined STM32C552xx

#include "stm32c5xx_hal.h"

#if defined USE_HAL_FDCAN_MODULE && (USE_HAL_FDCAN_MODULE == 1)
// HAL2's umbrella header pulls in only hal_def and a couple of LL headers, every module
// header has to be included by hand
#include "stm32c5xx_hal_fdcan.h"
#include "stm32c5xx_ll_bus.h"
#include "stm32-dronecan-driver.h"
#include <string.h>

// HAL2 renamed the CMSIS register helpers, alias the classic names the shared code uses
#ifndef READ_REG
  #define READ_REG(reg)          STM32_READ_REG(reg)
  #define CLEAR_BIT(reg, bit)    STM32_CLEAR_BIT((reg), (bit))
#endif


#define DC_HAL_ACCEPTANCE_FILTERS_NUM_MAX  8 // must be equal to SRAMCAN_FLE_NBR, for extended ids

// the three Tx buffers, HAL2 takes a bitmask of buffer indices
#define DC_HAL_TX_BUFFERS_ALL  (0x00000001U | 0x00000002U | 0x00000004U)

// HAL2 dropped the IS_FDCAN_xxx range macros, so check against our own limits
#define DC_IS_NOMINAL_PRESCALER(x)  (((x) >= DC_HAL_PRESCALER_MIN) && ((x) <= DC_HAL_PRESCALER_MAX))
#define DC_IS_NOMINAL_TSEG1(x)      (((x) >= DC_HAL_NOMINAL_BS1_MIN) && ((x) <= DC_HAL_NOMINAL_BS1_MAX))
#define DC_IS_NOMINAL_TSEG2(x)      (((x) >= DC_HAL_NOMINAL_BS2_MIN) && ((x) <= DC_HAL_NOMINAL_BS2_MAX))
#define DC_IS_NOMINAL_SJW(x)        (((x) >= DC_HAL_NOMINAL_SJW_MIN) && ((x) <= DC_HAL_NOMINAL_SJW_MAX))

// we can use IS_FDCAN_NOMINAL_PRESCALER(), IS_FDCAN_NOMINAL_TSEG1(), IS_FDCAN_NOMINAL_TSEG2(), IS_FDCAN_NOMINAL_SJW() !
#define DC_HAL_PRESCALER_MIN        1
#define DC_HAL_PRESCALER_MAX        512

#define DC_HAL_NOMINAL_BS1_MIN      1     // datasheet: bit_time must be 4 .. 81 tq
#define DC_HAL_NOMINAL_BS1_MAX      256
#define DC_HAL_NOMINAL_BS2_MIN      1
#define DC_HAL_NOMINAL_BS2_MAX      128
#define DC_HAL_NOMINAL_SJW_MIN      1
#define DC_HAL_NOMINAL_SJW_MAX      128

#define DC_HAL_DATA_PRESCALER_MIN   1
#define DC_HAL_DATA_PRESCALER_MAX   32
#define DC_HAL_DATA_BS1_MIN         1
#define DC_HAL_DATA_BS1_MAX         32
#define DC_HAL_DATA_BS2_MIN         1
#define DC_HAL_DATA_BS2_MAX         16
#define DC_HAL_DATA_SJW_MIN         1
#define DC_HAL_DATA_SJW_MAX         16    // datasheet: must always be smaller than BS2


static tDcHalStatistics dc_hal_stats = {};

static uint8_t abort_tx_on_error;

static hal_fdcan_handle_t hfdcan;
// HAL2's handle holds an instance enum, not a pointer, so keep our own pointer for the
// direct register accesses below. NULL means the iface was never opened.
static FDCAN_GlobalTypeDef* fdcan_regs = NULL;

static uint32_t tx_tlast_ms = 0; // for TX timeout error counting in dc_hal_transmit()
static uint8_t was_bo = 0; // for counting bus off errors only when state changes

static uint8_t fd_mode_enabled; // set when the iface was opened with data_timings != NULL
static uint8_t fd_frame_detected; // set once a FD frame has been seen


//-------------------------------------------------------
// Helper
//-------------------------------------------------------

static void _process_error_status(void)
{
    if (fdcan_regs == NULL) return; // iface was never opened, dc_hal_init() failed or was not called

//    FDCAN_ProtocolStatusTypeDef protocolStatus;
//    HAL_FDCAN_GetProtocolStatus(&hfdcan, &protocolStatus);
//    if (protocolStatus.BusOff) {
//        CLEAR_BIT(fdcan_regs->CCCR, FDCAN_CCCR_INIT);
//    }
    uint32_t psr = READ_REG(fdcan_regs->PSR); // read the protocol status register

    if ((psr & FDCAN_PSR_BO) != 0) { // is bus off
        CLEAR_BIT(fdcan_regs->CCCR, FDCAN_CCCR_INIT);
        HAL_FDCAN_ReqAbortOfTxBuffer(&hfdcan, DC_HAL_TX_BUFFERS_ALL);
        if (!was_bo) dc_hal_stats.bo_count++; // BO, bus off, only count when toggled from bus on to bus off
        was_bo = 1;
    } else {
        was_bo = 0;
    }

    uint32_t lec = (psr & FDCAN_PSR_LEC) >> FDCAN_PSR_LEC_Pos; // Last Error Code
    uint32_t dlec = (psr & FDCAN_PSR_DLEC) >> FDCAN_PSR_DLEC_Pos; // Data Last Error Code
    if ((lec != HAL_FDCAN_PROTOCOL_ERROR_NONE && lec != HAL_FDCAN_PROTOCOL_ERROR_NO_CHANGE) ||
        (dlec != HAL_FDCAN_PROTOCOL_ERROR_NONE && dlec != HAL_FDCAN_PROTOCOL_ERROR_NO_CHANGE)) {
        // no write to PSR here: LEC and DLEC are cleared to "no change" by the read of PSR
        // above, and the C5 header correctly declares PSR read only (the G4 and H5 headers
        // have it as __IO, so the G4/H5 drivers write it, which is a no-op on the hardware)
        if (abort_tx_on_error) {
            HAL_FDCAN_ReqAbortOfTxBuffer(&hfdcan, DC_HAL_TX_BUFFERS_ALL);
        }
        if (lec != HAL_FDCAN_PROTOCOL_ERROR_NONE && lec != HAL_FDCAN_PROTOCOL_ERROR_NO_CHANGE) {
            dc_hal_stats.lec_count++; // LEC, Last Error Code
            if (lec == HAL_FDCAN_PROTOCOL_ERROR_ACK) dc_hal_stats.lec_ack_count++;
        }
        // CAN FD diagnostics
        if (dlec != HAL_FDCAN_PROTOCOL_ERROR_NONE && dlec != HAL_FDCAN_PROTOCOL_ERROR_NO_CHANGE) {
            dc_hal_stats.dlec_count++; // DLEC, Data-phase Last Error Code
            switch (dlec) {
                case HAL_FDCAN_PROTOCOL_ERROR_STUFF: dc_hal_stats.dlec_stuff_count++; break;
                case HAL_FDCAN_PROTOCOL_ERROR_FORM: dc_hal_stats.dlec_form_count++; break;
                case HAL_FDCAN_PROTOCOL_ERROR_ACK: dc_hal_stats.dlec_ack_count++; break;
                case HAL_FDCAN_PROTOCOL_ERROR_BIT1: dc_hal_stats.dlec_bit1_count++; break;
                case HAL_FDCAN_PROTOCOL_ERROR_BIT0: dc_hal_stats.dlec_bit0_count++; break;
                case HAL_FDCAN_PROTOCOL_ERROR_CRC: dc_hal_stats.dlec_crc_count++; break;
            }
        }
    }

    if ((psr & FDCAN_PSR_PXE) != 0) { // protocol exception event occurred, happens when fc is not yet doing CAN
        // PXE is likewise cleared by the read of PSR above
        dc_hal_stats.pxe_count++; // PXE, Protocol Exception Event
    }

