jlpoltrack/mLRS/mLRS/modules/stm32-dronecan-lib/stm32-dronecan-driver-c5.c
    uint32_t ecr = READ_REG(fdcan_regs->ECR); // read the error counter register, read clears CEL
    dc_hal_stats.tec_count = (ecr & FDCAN_ECR_TEC) >> FDCAN_ECR_TEC_Pos; // TEC, Transmit Error Counter
    dc_hal_stats.rec_count = (ecr & FDCAN_ECR_REC) >> FDCAN_ECR_REC_Pos; // REC, Receive Error Counter
    if ((ecr & FDCAN_ECR_CEL) != 0) { // Can Error Logging
        dc_hal_stats.cel_count += (ecr & FDCAN_ECR_CEL) >> FDCAN_ECR_CEL_Pos; // CEL, Can Error Logging
    }

    // record some more
    if (lec != HAL_FDCAN_PROTOCOL_ERROR_NO_CHANGE) dc_hal_stats.last_lec = lec;
    dc_hal_stats.last_psr = psr;
    dc_hal_stats.last_ecr = ecr;
    dc_hal_stats.last_cccr = READ_REG(fdcan_regs->CCCR);
    // CAN FD
    if (dlec != HAL_FDCAN_PROTOCOL_ERROR_NO_CHANGE) dc_hal_stats.last_dlec = dlec;
}


// convert DLC field to data length in bytes (with CAN FD encoding)
static const uint8_t dlc_to_len[16] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 12, 16, 20, 24, 32, 48, 64};

uint8_t _data_len_from_dlc(uint8_t dlc)
{
    return (dlc < 16) ? dlc_to_len[dlc] : 64;
}


// convert data length in bytes to DLC field (with CAN FD encoding)
uint8_t _dlc_from_data_len(uint8_t data_len)
{
    if (data_len > 64) data_len = 64; // should not happen, but play it safe
    if (data_len <= 8) return data_len;
    if (data_len <= 12) return 9;
    if (data_len <= 16) return 10;
    if (data_len <= 20) return 11;
    if (data_len <= 24) return 12;
    if (data_len <= 32) return 13;
    if (data_len <= 48) return 14;
    return 15; // 49-64 bytes
}


//-------------------------------------------------------
// Init
//-------------------------------------------------------

int16_t dc_hal_init(
    DC_HAL_CAN_ENUM can_instance,
    const tDcHalCanTimings* const timings,
    const tDcHalCanDataTimings* const data_timings,
    const DC_HAL_IFACE_MODE_ENUM iface_mode)
{
    if ((iface_mode != DC_HAL_IFACE_MODE_NORMAL) &&
        (iface_mode != DC_HAL_IFACE_MODE_SILENT) &&
        (iface_mode != DC_HAL_IFACE_MODE_AUTOMATIC_TX_ABORT_ON_ERROR)) {
        return -DC_HAL_ERROR_INVALID_ARGUMENT;
    }

    if ((timings == NULL) ||
        !DC_IS_NOMINAL_PRESCALER(timings->bit_rate_prescaler) ||
        !DC_IS_NOMINAL_TSEG1(timings->bit_segment_1) ||
        !DC_IS_NOMINAL_TSEG2(timings->bit_segment_2) ||
        !DC_IS_NOMINAL_SJW(timings->sync_jump_width)) {
        return -DC_HAL_ERROR_INVALID_ARGUMENT;
    }

    memset(&dc_hal_stats, 0, sizeof(dc_hal_stats));
    abort_tx_on_error = (iface_mode == DC_HAL_IFACE_MODE_AUTOMATIC_TX_ABORT_ON_ERROR);

    fd_mode_enabled = (data_timings != NULL); // nullptr doesn't work, as undeclared
    fd_frame_detected = 0;

    // the C552 has FDCAN1 only, can_instance is accepted but ignored
    (void)can_instance;

    if (HAL_FDCAN_Init(&hfdcan, HAL_FDCAN1) != HAL_OK) {
        return -DC_HAL_ERROR_CAN_INIT;
    }
    fdcan_regs = FDCAN1;

    hal_fdcan_config_t cfg = {0};

    cfg.mode = HAL_FDCAN_MODE_NORMAL;

    cfg.auto_retransmission = HAL_FDCAN_AUTO_RETRANSMISSION_ENABLE; // ArduPilot has it enabled, so also do
    cfg.transmit_pause = HAL_FDCAN_TRANSMIT_PAUSE_ENABLE; // insert pause between TX frames to reduce bus contention
    cfg.protocol_exception = HAL_FDCAN_PROTOCOL_EXCEPTION_DISABLE; // treat exceptions as form errors

    cfg.nominal_bit_timing.nominal_prescaler = timings->bit_rate_prescaler;
    cfg.nominal_bit_timing.nominal_time_seg1 = timings->bit_segment_1;
    cfg.nominal_bit_timing.nominal_time_seg2 = timings->bit_segment_2;
    cfg.nominal_bit_timing.nominal_jump_width = timings->sync_jump_width;

    if (fd_mode_enabled) {
        // enable FD frame format with BRS - allows receiving both classic CAN and CAN FD frames
        cfg.frame_format = HAL_FDCAN_FRAME_FORMAT_FD_BRS;
        cfg.data_bit_timing.data_prescaler = data_timings->bit_rate_prescaler;
        cfg.data_bit_timing.data_time_seg1 = data_timings->bit_segment_1;
        cfg.data_bit_timing.data_time_seg2 = data_timings->bit_segment_2;
        cfg.data_bit_timing.data_jump_width = data_timings->sync_jump_width;
    } else {
        cfg.frame_format = HAL_FDCAN_FRAME_FORMAT_CLASSIC_CAN;
        cfg.data_bit_timing.data_prescaler = 1; // irrelevant if frame_format is not FD_BRS
        cfg.data_bit_timing.data_time_seg1 = 1;
        cfg.data_bit_timing.data_time_seg2 = 1;
        cfg.data_bit_timing.data_jump_width = 1;
    }

    cfg.std_filters_nbr = 0; // these size the message RAM filter blocks
    cfg.ext_filters_nbr = DC_HAL_ACCEPTANCE_FILTERS_NUM_MAX;

    cfg.tx_fifo_queue_mode = HAL_FDCAN_TX_MODE_FIFO;

    if (HAL_FDCAN_SetConfig(&hfdcan, &cfg) != HAL_OK) {
        fdcan_regs = NULL;
        return -DC_HAL_ERROR_CAN_INIT;
    }

    if (fd_mode_enabled && data_timings->tdco > 0) { // Transceiver Delay Compensation for CANFD
        hal_fdcan_tx_delay_comp_config_t tdc = {0};
        tdc.tx_delay_comp_offset = data_timings->tdco;
        tdc.tx_delay_comp_win_length = 0;
        HAL_FDCAN_SetConfigTxDelayCompensation(&hfdcan, &tdc);
        HAL_FDCAN_EnableTxDelayCompensation(&hfdcan);
    }

    // configure reception filter
    //   follow libcanard's default filter setup in spirit
    //   here it is really needed since the FDCAN RAM was already set up for max num filters
    // at least one filter must be enabled for receive to work
    hal_fdcan_filter_t sFilterConfig = {0};
    sFilterConfig.id_type = HAL_FDCAN_ID_EXTENDED;
    sFilterConfig.filter_type = HAL_FDCAN_FILTER_TYPE_CLASSIC; // filter_id1 = id, filter_id2 = mask
    sFilterConfig.filter_id1 = 0;
    sFilterConfig.filter_id2 = 0;

    for (uint8_t n = 0; n < DC_HAL_ACCEPTANCE_FILTERS_NUM_MAX; n++) {
        sFilterConfig.filter_config = (n == 0) ? HAL_FDCAN_FILTER_TO_RX_FIFO_0 : HAL_FDCAN_FILTER_DISABLE;
        sFilterConfig.filter_index = n;
        if (HAL_FDCAN_SetFilter(&hfdcan, &sFilterConfig) != HAL_OK) {
            return -DC_HAL_ERROR_CAN_CONFIG_FILTER;
        }
    }

    // configure global filter
    //  reject non matching frames with STD and EXT ID
    //  filter all remote frames with STD and EXT ID
    hal_fdcan_global_filter_config_t gfilter = {0};
    gfilter.acceptance_non_matching_std = HAL_FDCAN_NO_MATCH_REJECT;
    gfilter.acceptance_non_matching_ext = HAL_FDCAN_NO_MATCH_REJECT;
    gfilter.acceptance_remote_std = HAL_FDCAN_REMOTE_REJECT;
    gfilter.acceptance_remote_ext = HAL_FDCAN_REMOTE_REJECT;
    if (HAL_FDCAN_SetGlobalFilter(&hfdcan, &gfilter) != HAL_OK) {
        return -DC_HAL_ERROR_CAN_CONFIG_GLOBAL_FILTER;
    }

