jlpoltrack/mLRS/mLRS/modules/stm32-dronecan-lib/stm32-dronecan-driver-c5.c
    return 0;
}


int16_t dc_hal_start(void)
{
    if (fdcan_regs == NULL) { return -DC_HAL_ERROR_CAN_START; } // iface was never opened

    if (HAL_FDCAN_Start(&hfdcan) != HAL_OK) { return -DC_HAL_ERROR_CAN_START; }

    return 0;
}


uint8_t dc_hal_is_canfd(void)
{
    return fd_frame_detected; // only ever becomes true if also fd_mode_enabled is true
}


//-------------------------------------------------------
// Transmit
//-------------------------------------------------------

int16_t dc_hal_transmit(const CanardCANFrame* const frame, uint32_t tnow_ms)
{
    if (fdcan_regs == NULL) { return -DC_HAL_ERROR_CAN_ADD_TX_MESSAGE; } // iface was never opened

    if (frame == NULL) {
        return -DC_HAL_ERROR_INVALID_ARGUMENT;
    }

    if (frame->id & CANARD_CAN_FRAME_ERR) {
        return -DC_HAL_ERROR_UNSUPPORTED_FRAME_FORMAT;
    }
    if (frame->id & CANARD_CAN_FRAME_RTR) { // DroneCAN does not use REMOTE frames
        return -DC_HAL_ERROR_UNSUPPORTED_FRAME_FORMAT;
    }
    if (!(frame->id & CANARD_CAN_FRAME_EFF)) { // DroneCAN does not use STD ID, uses only EXT frames
        return -DC_HAL_ERROR_UNSUPPORTED_FRAME_FORMAT;
    }

    if (!fd_mode_enabled && frame->data_len > 8) { // don't do FD if not enabled
        return -DC_HAL_ERROR_UNSUPPORTED_FRAME_FORMAT;
    }

    _process_error_status();

    // thx to the TxFiFo in the C5 we can do the crude method and just put the message into the fifo if there is space
    // check for space in fifo
    if (HAL_FDCAN_GetTxFifoFreeLevel(&hfdcan) == HAL_FDCAN_TX_FIFO_FREE_LEVEL_0) {
        if (tx_tlast_ms > 0 && (tnow_ms - tx_tlast_ms) > 10) {
            dc_hal_stats.tffl_count++; // TFFL, Tx Fifo Free Level
        }
        return 0; // no space, postpone
    }
    // this check is done in HAL_FDCAN_AddMessageToTxFifoQ(), so better do it here too
    if ((fdcan_regs->TXFQS & FDCAN_TXFQS_TFQF) != 0) {
        if (tx_tlast_ms > 0 && (tnow_ms - tx_tlast_ms) > 10) {
            dc_hal_stats.tfqf_count++; // TFQF, Tx Fifo Queue Full
        }
        return 0; // tx fifo queue full, postpone
    }

    // HAL2's Tx header is a bitfield union written straight into the message RAM word,
    // so every field is the plain code here, nothing is pre-shifted
    hal_fdcan_tx_header_t pTxHeader;
    pTxHeader.d64 = 0;
    pTxHeader.b.error_state_indicator = HAL_FDCAN_ERROR_STATE_IND_ACTIVE;
    if (fd_mode_enabled && frame->canfd) {
        pTxHeader.b.bit_rate_switch = HAL_FDCAN_BIT_RATE_SWITCH_ON;
        pTxHeader.b.frame_format = HAL_FDCAN_HEADER_FRAME_FORMAT_FD_CAN;
    } else {
        pTxHeader.b.bit_rate_switch = HAL_FDCAN_BIT_RATE_SWITCH_OFF;
        pTxHeader.b.frame_format = HAL_FDCAN_HEADER_FRAME_FORMAT_CAN;
    }
    pTxHeader.b.event_fifo_control = HAL_FDCAN_TX_EVENTS_FIFO_DISCARD;
    pTxHeader.b.message_marker = 0;

    pTxHeader.b.identifier = (frame->id & CANARD_CAN_EXT_ID_MASK);
    pTxHeader.b.identifier_type = HAL_FDCAN_ID_EXTENDED;
    pTxHeader.b.frame_type = HAL_FDCAN_FRAME_DATA;

    pTxHeader.b.data_length = (hal_fdcan_data_length_code_t)_dlc_from_data_len(frame->data_len);

    if (HAL_FDCAN_ReqTransmitMsgFromFIFOQ(&hfdcan, &pTxHeader, frame->data) != HAL_OK) {
        return -DC_HAL_ERROR_CAN_ADD_TX_MESSAGE;
    }

    tx_tlast_ms = tnow_ms;
    dc_hal_stats.transmitted_frame_count++;

    return 1;
}


//-------------------------------------------------------
// Receive
//-------------------------------------------------------
#ifndef DRONECAN_USE_RX_ISR
//-- Polling
#error CAN polling not supported, DRONECAN_USE_RX_ISR must be defined !
#else
//-- ISR

#define DC_FDCAN_RX_FIFO_ELEMENT_SIZE  (18U * 4U) // Rx FIFO 0/1 element size in bytes, 2 words + 64 bytes = 18*4, equals SRAMCAN_RFx_SIZE


typedef struct
{
    uint32_t r0;
    uint32_t r1;
    union {
        uint8_t data[CANARD_CANFD_FRAME_MAX_DATA_LEN];
        uint32_t data_32[CANARD_CANFD_FRAME_MAX_DATA_LEN / 4]; // CANARD_CANFD_FRAME_MAX_DATA_LEN should be divisible by 4
    };
} tDcRxFifoElement;


typedef enum // see table 400 in datasheet, unfortunately defined in stm32h5xx_hal_fdcan.c and not in .h file
{
    DC_RX_FIFO_R0_XTD_BIT     = 0x40000000U, // extended identifier, equals FDCAN_ELEMENT_MASK_XTD
    DC_RX_FIFO_R0_RTR_BIT     = 0x20000000U, // remote transmission request, equals FDCAN_ELEMENT_MASK_RTR
    DC_RX_FIFO_R0_EXTID_MASK  = 0x1FFFFFFFU, // identifier, equals FDCAN_ELEMENT_MASK_EXTID, CANARD_CAN_EXT_ID_MASK
    DC_RX_FIFO_R1_FDF_BIT     = 0x00200000U, // FD format, equals FDCAN_ELEMENT_MASK_FDF
    DC_RX_FIFO_R1_BRS_BIT     = 0x00100000U, // bit rate switch, equals FDCAN_ELEMENT_MASK_BRS
    DC_RX_FIFO_R1_DLC_MASK    = 0x000F0000U, // data length code, equals FDCAN_ELEMENT_MASK_DLC, FDCAN_DLC_BYTES_64
} DC_RX_FIFO_ELEMENT_ENUM;


#define DRONECAN_RXFRAMEBUFSIZEMASK  (DRONECAN_RXFRAMEBUFSIZE - 1)


volatile tDcRxFifoElement dronecan_rxbuf[DRONECAN_RXFRAMEBUFSIZE];
volatile uint16_t dronecan_rxwritepos; // pos at which the last frame was stored
volatile uint16_t dronecan_rxreadpos; // pos at which the next frame is to be fetched


void _dc_hal_receive_isr(uint32_t* RxAddress)
{
    uint32_t r0 = *RxAddress;
    if ((r0 & DC_RX_FIFO_R0_XTD_BIT) == 0) { // DroneCAN uses only EXT frames, so this should be an error
        dc_hal_stats.isr_xtd_count++;
        return;
    }
    if ((r0 & DC_RX_FIFO_R0_RTR_BIT) != 0) { // DroneCAN does not use RTR frames, so this should be an error
        dc_hal_stats.isr_rtr_count++;
        return;
    }

    RxAddress++;
    uint32_t r1 = *RxAddress;
    bool is_fd_frame = ((r1 & DC_RX_FIFO_R1_FDF_BIT) != 0);
    if (!fd_mode_enabled) {
        if (is_fd_frame) {
            dc_hal_stats.isr_fdf_count++;
            return;
        }
        if ((r1 & DC_RX_FIFO_R1_BRS_BIT) != 0) {
            dc_hal_stats.isr_brs_count++;
            return;
        }
    } else {
        if (is_fd_frame) fd_frame_detected = 1; // report that one FD frame has been seen
    }

    // for classic CAN, reject frames with DLC > 8
    // compare the extracted DLC, not the masked register field against FDCAN_DLC_BYTES_8,
    // as the meaning of FDCAN_DLC_BYTES_x differs between the G4 and H5 HAL generations
    if (!is_fd_frame && (((r1 & DC_RX_FIFO_R1_DLC_MASK) >> 16) > 8)) {
        dc_hal_stats.isr_dlc_count++;
        return;
    }

    uint16_t next = (dronecan_rxwritepos + 1) & DRONECAN_RXFRAMEBUFSIZEMASK;
    if (dronecan_rxreadpos != next) { // fifo not full
        dronecan_rxwritepos = next;

        dronecan_rxbuf[next].r0 = r0;
        dronecan_rxbuf[next].r1 = r1;
        RxAddress++;
        // copy all data bytes based on actual DLC (H5 message RAM supports 64 bytes)
        uint32_t dlc = (r1 & DC_RX_FIFO_R1_DLC_MASK) >> 16;
        uint8_t data_len = _data_len_from_dlc(dlc);
        uint8_t word_len = (data_len + 3) / 4; // round up to full words
        for (uint8_t i = 0; i < word_len; i++) {
            dronecan_rxbuf[next].data_32[i] = *RxAddress;
            RxAddress++;
        }

        // fill can reach DRONECAN_RXFRAMEBUFSIZE - 1 at most, one slot is always kept free
        uint16_t fill = (next - dronecan_rxreadpos) & DRONECAN_RXFRAMEBUFSIZEMASK;
        if (fill > dc_hal_stats.rx_fifo_peak) dc_hal_stats.rx_fifo_peak = fill;

    } else {
        dc_hal_stats.rx_overflow_count++; // rx frame buffer overflow
        dc_hal_stats.rx_fifo_peak = DRONECAN_RXFRAMEBUFSIZE; // full
    }
}


void _dc_hal_isr_handler(void)
{
    //HAL_FDCAN_IRQHandler(&hfdcan); HAL_FDCAN_GetRxMessage();
    // copy the part relevant to us
    // flags:
    //   FDCAN_IR_RF0L           // Rx FIFO 0 message lost
    //   FDCAN_IR_RF0F           // Rx FIFO 0 full
    //   FDCAN_IR_RF0N           // New message written to Rx FIFO 0
    // more descriptive defines are in the HAL, like FDCAN_FLAG_RX_FIFO0_NEW_MESSAGE
    // #define FDCAN_RX_FIFO0_MASK (FDCAN_IR_RF0L | FDCAN_IR_RF0F | FDCAN_IR_RF0N)
    // there are also analogous defines
    //   FDCAN_IE_RF0LE          // Rx FIFO 0 message lost
    //   FDCAN_IE_RF0FE          // Rx FIFO 0 full
    //   FDCAN_IE_RF0NE          // New message written to Rx FIFO 0
    // for which there are also more descriptive defines in the HAL, like FDCAN_IT_RX_FIFO0_NEW_MESSAGE

    uint32_t RxFifo0ITs = fdcan_regs->IR & (FDCAN_IR_RF0N | FDCAN_IR_RF0F | FDCAN_IR_RF0L); // __HAL_FDCAN_GET_FLAG(), equals FDCAN_RX_FIFO0_MASK
    RxFifo0ITs &= fdcan_regs->IE; // __HAL_FDCAN_GET_IT_SOURCE()
    uint32_t RxFifo1ITs = fdcan_regs->IR & (FDCAN_IR_RF1N | FDCAN_IR_RF1F | FDCAN_IR_RF1L); // equals FDCAN_RX_FIFO1_MASK
    RxFifo1ITs &= fdcan_regs->IE;

