jlpoltrack/mLRS/mLRS/modules/stm32-dronecan-lib/stm32-dronecan-driver-c5.c
    if (RxFifo0ITs != 0) {
        fdcan_regs->IR = RxFifo0ITs; // clear Rx FIFO0 flags

        if ((RxFifo0ITs & (FDCAN_IR_RF0N | FDCAN_IR_RF0F)) != 0) { // do it also if Rx FIFO 0 full
            // HAL_FDCAN_GetRxMessage()
            while ((fdcan_regs->RXF0S & FDCAN_RXF0S_F0FL) != 0) { // Rx FIFO 0 not empty
                // calculate Rx FIFO 0 element address
                uint32_t GetIndex = ((fdcan_regs->RXF0S & FDCAN_RXF0S_F0GI) >> FDCAN_RXF0S_F0GI_Pos);
                uint32_t* RxAddress = (uint32_t*)(hfdcan.msg_ram.rx_fifo0_start_addr + (GetIndex * DC_FDCAN_RX_FIFO_ELEMENT_SIZE));
                _dc_hal_receive_isr(RxAddress);
                // acknowledge the Rx FIFO 0 that the oldest element is read so that it increments the GetIndex
                fdcan_regs->RXF0A = GetIndex;
            }
        }

        if ((RxFifo0ITs & FDCAN_IR_RF0F) != 0) {
            dc_hal_stats.isr_rf0f_count++; // RF0F, Rx Fifo 0 Full
        }
        if ((RxFifo0ITs & FDCAN_IR_RF0L) != 0) {
            dc_hal_stats.isr_rf0l_count++; // RF0L, Rx Fifo 0 Message Lost
        }
    }

    if (RxFifo1ITs != 0) {
        fdcan_regs->IR = RxFifo1ITs; // clear Rx FIFO1 flags

        if ((RxFifo1ITs & (FDCAN_IR_RF1N | FDCAN_IR_RF1F)) != 0) { // do it also if Rx FIFO 1 full
            while ((fdcan_regs->RXF1S & FDCAN_RXF1S_F1FL) != 0) { // Rx FIFO 1 not empty
                // calculate Rx FIFO 1 element address
                uint32_t GetIndex = ((fdcan_regs->RXF1S & FDCAN_RXF1S_F1GI) >> FDCAN_RXF1S_F1GI_Pos);
                uint32_t* RxAddress = (uint32_t*)(hfdcan.msg_ram.rx_fifo1_start_addr + (GetIndex * DC_FDCAN_RX_FIFO_ELEMENT_SIZE));
                _dc_hal_receive_isr(RxAddress);
                // acknowledge the Rx FIFO 1 that the oldest element is read so that it increments the GetIndex
                fdcan_regs->RXF1A = GetIndex;
            }
        }

        if ((RxFifo1ITs & FDCAN_IR_RF1F) != 0) {
            dc_hal_stats.isr_rf1f_count++; // RF1F, Rx Fifo 1 Full
        }
        if ((RxFifo1ITs & FDCAN_IR_RF1L) != 0) {
            dc_hal_stats.isr_rf1l_count++; // RF1L, Rx Fifo 1 Message Lost
        }
    }

    // EOL: Error Logging Overflow                -> Bit and Line Error
    // WDI: Watchdog Interrupt                    -> Protocol Error
    // PEA: Protocol Error in Arbitration Phase   -> Protocol Error
    // PED: Protocol Error in Data Phase          -> Protocol Error
    // ARA: Access to Reserved Address            -> Protocol Error
    uint32_t Errors = fdcan_regs->IR & (FDCAN_IR_ELO | FDCAN_IR_WDI | FDCAN_IR_PEA | FDCAN_IR_PED | FDCAN_IR_ARA);
    Errors &= fdcan_regs->IE;
    // EP: Error Passive                          -> Bit and Line Error
    // EW: Warning Status                         -> Protocol Error
    // BO: Bus_Off Status                         -> Protocol Error
    uint32_t ErrorStatusITs = fdcan_regs->IR & (FDCAN_IR_EP | FDCAN_IR_EW | FDCAN_IR_BO);
    ErrorStatusITs &= fdcan_regs->IE;

    if (Errors != 0) {
        fdcan_regs->IR = Errors; // clear the Error flags
        dc_hal_stats.isr_errors_count++;
    }
    if (ErrorStatusITs != 0) {
        fdcan_regs->IR = ErrorStatusITs; // clear the Error flags
        dc_hal_stats.isr_errorstatus_count++;
    }
}


// is already C context, not C++ !

#ifdef FDCAN2
void FDCAN2_IT0_IRQHandler(void)
{
    if (fdcan_regs == FDCAN2) _dc_hal_isr_handler();
}
#endif

void FDCAN1_IT0_IRQHandler(void)
{
    if (fdcan_regs == FDCAN1) _dc_hal_isr_handler();
}


//-- API

int16_t dc_hal_enable_isr(void)
{
    if (fdcan_regs == NULL) { return -DC_HAL_ERROR_ISR_CONFIG; } // iface was never opened

    dronecan_rxwritepos = 0;
    dronecan_rxreadpos = 0;
    memset(&dc_hal_stats, 0, sizeof(dc_hal_stats));
    fd_frame_detected = 0;

    // HAL2 doc: by default all interrupts are assigned to line 0, so no
    // HAL_FDCAN_SetInterruptGroupsToLine() is needed here
    if (HAL_FDCAN_EnableInterrupts(
            &hfdcan,
            HAL_FDCAN_IT_RX_FIFO_0_NEW_MSG | HAL_FDCAN_IT_RX_FIFO_0_FULL |
            HAL_FDCAN_IT_RX_FIFO_1_NEW_MSG | HAL_FDCAN_IT_RX_FIFO_1_FULL |
            HAL_FDCAN_IT_BUS_OFF) != HAL_OK) {
        return -DC_HAL_ERROR_ISR_CONFIG;
    }

    if (HAL_FDCAN_EnableInterruptLines(&hfdcan, HAL_FDCAN_IT_LINE_0) != HAL_OK) {
        return -DC_HAL_ERROR_ISR_CONFIG;
    }

    fdcan_regs->IR = 0xFFFFFFFF; // clear all flags by writing 1 to them

#ifdef FDCAN2
    if (fdcan_regs == FDCAN2) {
        NVIC_SetPriority(FDCAN2_IT0_IRQn, DRONECAN_IRQ_PRIORITY);
        NVIC_EnableIRQ(FDCAN2_IT0_IRQn);
    } else
#endif
    if (fdcan_regs == FDCAN1) {
        NVIC_SetPriority(FDCAN1_IT0_IRQn, DRONECAN_IRQ_PRIORITY);
        NVIC_EnableIRQ(FDCAN1_IT0_IRQn);
    }

    return 0;
}


int16_t dc_hal_receive(CanardCANFrame* const frame)
{
    if (fdcan_regs == NULL) { return 0; } // iface was never opened

    if (frame == NULL) {
        return -DC_HAL_ERROR_INVALID_ARGUMENT;
    }

    _process_error_status();

    if (dronecan_rxwritepos == dronecan_rxreadpos) {
        return 0; // fifo empty
    }

    uint16_t rxreadpos = (dronecan_rxreadpos + 1) & DRONECAN_RXFRAMEBUFSIZEMASK;
    dronecan_rxreadpos = rxreadpos;

    frame->id = (dronecan_rxbuf[rxreadpos].r0 & DC_RX_FIFO_R0_EXTID_MASK) >> 0;
    frame->id |= CANARD_CAN_FRAME_EFF;

    // convert DLC to actual byte count
    uint32_t dlc = (dronecan_rxbuf[rxreadpos].r1 & DC_RX_FIFO_R1_DLC_MASK) >> 16;
    frame->data_len = _data_len_from_dlc(dlc);
    if (frame->data_len > CANARD_CANFD_FRAME_MAX_DATA_LEN) frame->data_len = CANARD_CANFD_FRAME_MAX_DATA_LEN; // should not happen, but play it safe

    // copy data bytes, and zero-fill
    for (uint8_t n = 0; n < CANARD_CANFD_FRAME_MAX_DATA_LEN; n++) {
        frame->data[n] = (n < frame->data_len) ? dronecan_rxbuf[rxreadpos].data[n] : 0;
    }

    frame->iface_id = 0;

    frame->canfd = ((dronecan_rxbuf[rxreadpos].r1 & DC_RX_FIFO_R1_FDF_BIT) != 0);

    dc_hal_stats.received_frame_count++;

    return 1;
}


void dc_hal_rx_flush(void)
{
    if (fdcan_regs == NULL) return; // iface was never opened

    dronecan_rxwritepos = 0;
    dronecan_rxreadpos = 0;
    dc_hal_stats.rx_overflow_count = 0;
}


#endif // DRONECAN_USE_RX_ISR


//-------------------------------------------------------
// Filter
//-------------------------------------------------------

// num_filter_configs = 0 rejects all frames
int16_t dc_hal_config_acceptance_filters(
    const tDcHalAcceptanceFilterConfiguration* const filter_configs,
    const uint8_t num_filter_configs)
{
    if (fdcan_regs == NULL) { return -DC_HAL_ERROR_CAN_CONFIG_FILTER; } // iface was never opened

    if ((filter_configs == NULL) || (num_filter_configs > DC_HAL_ACCEPTANCE_FILTERS_NUM_MAX)) {
        return -DC_HAL_ERROR_INVALID_ARGUMENT;
    }

    hal_fdcan_filter_t sFilterConfig = {0};
    sFilterConfig.id_type = HAL_FDCAN_ID_EXTENDED;
    sFilterConfig.filter_type = HAL_FDCAN_FILTER_TYPE_CLASSIC; // filter_id1 = id, filter_id2 = mask
    sFilterConfig.filter_config = HAL_FDCAN_FILTER_TO_RX_FIFO_0;
    sFilterConfig.filter_index = 0;
    sFilterConfig.filter_id1 = 0;
    sFilterConfig.filter_id2 = 0;

    for (uint8_t n = 0; n < num_filter_configs; n++) {
        if (filter_configs[n].rx_fifo == DC_HAL_RX_FIFO0) {
            sFilterConfig.filter_config = HAL_FDCAN_FILTER_TO_RX_FIFO_0;
        } else
        if (filter_configs[n].rx_fifo == DC_HAL_RX_FIFO1) {
            sFilterConfig.filter_config = HAL_FDCAN_FILTER_TO_RX_FIFO_1;
        } else {
            sFilterConfig.filter_config = ((n & 0x01) == 0) ? HAL_FDCAN_FILTER_TO_RX_FIFO_0 : HAL_FDCAN_FILTER_TO_RX_FIFO_1;
        }
        sFilterConfig.filter_index = n;
        sFilterConfig.filter_id1 = (filter_configs[n].id & CANARD_CAN_EXT_ID_MASK);
        sFilterConfig.filter_id2 = (filter_configs[n].mask & CANARD_CAN_EXT_ID_MASK);
        if (HAL_FDCAN_SetFilter(&hfdcan, &sFilterConfig) != HAL_OK) { return -DC_HAL_ERROR_CAN_CONFIG_FILTER; }
    }

    // fill remaining filters with default
    sFilterConfig.filter_id1 = 0;
    sFilterConfig.filter_id2 = 0;
    for (uint8_t n = num_filter_configs; n < DC_HAL_ACCEPTANCE_FILTERS_NUM_MAX; n++) {
        sFilterConfig.filter_config = HAL_FDCAN_FILTER_DISABLE;
        sFilterConfig.filter_index = n;
        if (HAL_FDCAN_SetFilter(&hfdcan, &sFilterConfig) != HAL_OK) { return -DC_HAL_ERROR_CAN_CONFIG_FILTER; }
    }

