jlpoltrack/mLRS/mLRS/modules/stm32-dronecan-lib/stm32-dronecan-driver-c5.c
    return 0;
}


int16_t dc_hal_compute_data_timings(
    const uint32_t peripheral_clock_rate,
    const uint32_t target_data_bit_rate,
    tDcHalCanDataTimings* const data_timings)
{
    if ((peripheral_clock_rate != 80000000) && (peripheral_clock_rate != 72000000)) {
        return -DC_HAL_ERROR_UNSUPPORTED_CLOCK_FREQUENCY;
    }

    // table for the C5's 72 MHz FDCAN clock, PSIK = PSI 144 MHz / 2, see stdstm32-can.h.
    // Every entry lands on 18 tq per bit with SP = 14/18 = 77.8%, except 8 Mbps which only
    // has 9 tq to work with. 5 Mbps is absent on purpose: 72 MHz / 5 Mbps = 14.4, not a whole
    // number of tq, and no prescaler can fix that - 144 MHz has no factor of 5.
    if (peripheral_clock_rate == 72000000) {
        if (target_data_bit_rate == 1000000) {
            data_timings->bit_rate_prescaler = 4;
            data_timings->bit_segment_1 = 13;
            data_timings->bit_segment_2 = 4;
            data_timings->sync_jump_width = 4;
        } else if (target_data_bit_rate == 2000000) {
            data_timings->bit_rate_prescaler = 2;
            data_timings->bit_segment_1 = 13;
            data_timings->bit_segment_2 = 4;
            data_timings->sync_jump_width = 4;
        } else if (target_data_bit_rate == 4000000) {
            data_timings->bit_rate_prescaler = 1;
            data_timings->bit_segment_1 = 13;
            data_timings->bit_segment_2 = 4;
            data_timings->sync_jump_width = 4;
        } else if (target_data_bit_rate == 8000000) {
            data_timings->bit_rate_prescaler = 1;
            data_timings->bit_segment_1 = 6;
            data_timings->bit_segment_2 = 2;
            data_timings->sync_jump_width = 2;
        } else {
            return -DC_HAL_ERROR_UNSUPPORTED_BIT_RATE;
        }
        goto CHECK_DATA_TIMINGS;
    }

    // ArduPilot table for 80 MHz, ardupilot/libraries/AP_HAL_ChibiOS/CANFDIface.cpp
    if (target_data_bit_rate == 1000000) {
        data_timings->bit_rate_prescaler = 4;
        data_timings->bit_segment_1 = 14;
        data_timings->bit_segment_2 = 5;
        data_timings->sync_jump_width = 5;
    } else if (target_data_bit_rate == 2000000) {
        data_timings->bit_rate_prescaler = 2;
        data_timings->bit_segment_1 = 14;
        data_timings->bit_segment_2 = 5;
        data_timings->sync_jump_width = 5;
    } else if (target_data_bit_rate == 4000000) {
        data_timings->bit_rate_prescaler = 1;
        data_timings->bit_segment_1 = 14;
        data_timings->bit_segment_2 = 5;
        data_timings->sync_jump_width = 5;
    } else if (target_data_bit_rate == 5000000) {
        data_timings->bit_rate_prescaler = 1;
        data_timings->bit_segment_1 = 11;
        data_timings->bit_segment_2 = 4;
        data_timings->sync_jump_width = 4;
    } else if (target_data_bit_rate == 8000000) {
        data_timings->bit_rate_prescaler = 1;
        data_timings->bit_segment_1 = 6;
        data_timings->bit_segment_2 = 3;
        data_timings->sync_jump_width = 3;
    } else {
        return -DC_HAL_ERROR_UNSUPPORTED_BIT_RATE;
    }

CHECK_DATA_TIMINGS: ;
    // let's do a check
    const uint32_t bit_time = (1 + data_timings->bit_segment_1 + data_timings->bit_segment_2) * data_timings->bit_rate_prescaler;
    const uint32_t expected = peripheral_clock_rate / target_data_bit_rate;
    if (bit_time != expected) {
        return -DC_HAL_ERROR_TIMING;
    }

    // transceiver delay compensation (TDC) is only needed for fast data prescalers
    // RM0492: TDC is intended for data prescaler 1 or 2, slower ones (prescaler > 2) do not need it
    // TDC offset is in FDCAN clock cycles (= 125 ns @ 80 MHz)
    // ArduPilot's value is 10 (tuned for a 120 ns MCP2557FD-class transceiver)
    data_timings->tdco = (data_timings->bit_rate_prescaler <= 2) ? 10 : 0;

    return 0;
}





/*
https://phryniszak.github.io/stm32g-fdcan/
https://github.com/phryniszak/stm32g-fdcan?tab=readme-ov-file
nominal:  TSeg1 = 127,  Tseg2 = 42, SJW = 42, Prescale = 1     75%
data:     TSeg1 = 7,    Tseg2 = 2,  SJW = 2, Prescale = 17     80%

https://kvaser.com/support/calculators/can-fd-bit-timing-calculator/
170 MHz, 500 ppm, 100ns
1MB/s 1MB/s
for ca 75%
nominal:  TSeg1 = 85 + 42 = 127,  Tseg2 = 42, SJW = 43, Prescale = 1
data:     TSeg1 = 126,            Tseg2 = 43, SJW = 43, Prescale = 1

STM32G4 examples
https://github.com/STMicroelectronics/STM32CubeG4/tree/master/Projects/STM32G474E-EVAL/Examples/FDCAN

https://github.com/pierremolinaro/acanfd-stm32

https://github.com/ArduPilot/ardupilot/blob/master/libraries/AP_HAL_ChibiOS/CANFDIface.cpp

https://github.com/am32-firmware/AM32/pull/36/files

https://github.com/ARMmbed/mbed-os/pull/13565/files
*/
/*
good source on CAN errors
https://www.csselectronics.com/pages/can-bus-errors-intro-tutorial
*/


#endif // USE_HAL_FDCAN_MODULE
#endif // STM32C552xx
